#### Day 8: Joins â€“ Basics ðŸŒŸ

Welcome to Day 8! Today, weâ€™ll dive into the fascinating world of SQL Joins. Joins allow you to combine data from multiple tables into meaningful insights.

#### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

#### 1. INNER JOIN
Returns records that have matching values in both tables.

In [3]:
query = """
SELECT employees.name, departments.department_name
FROM employees
INNER JOIN departments
ON employees.department_id = departments.department_id;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9492\2923934368.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name department_name
0       Alan              IT
1      Brian       Marketing
2  Catherine              HR
3      Dylan              IT
4       Evan         Finance
5      Helen       Marketing

#### 2. LEFT JOIN
Returns all records from the left table and matched records from the right table.

In [4]:
query = """
SELECT employees.name, departments.department_name
FROM employees
LEFT JOIN departments
ON employees.department_id = departments.department_id;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9492\3868574360.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name department_name
0       Alan              IT
1      Brian       Marketing
2  Catherine              HR
3      Dylan              IT
4       Evan         Finance
5      Helen       Marketing

#### 3. RIGHT JOIN
Returns all records from the right table and matched records from the left table.

In [5]:
query = """
SELECT employees.name, departments.department_name
FROM employees
RIGHT JOIN departments
ON employees.department_id = departments.department_id;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9492\3312254554.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name department_name
0       Alan              IT
1      Dylan              IT
2  Catherine              HR
3      Brian       Marketing
4      Helen       Marketing
5       Evan         Finance

#### 4. FULL OUTER JOIN (Simulated in MySQL)
MySQL doesn't support FULL OUTER JOIN directly, so we use UNION of LEFT and RIGHT joins.

In [6]:
query = """
SELECT employees.name, departments.department_name
FROM employees
LEFT JOIN departments ON employees.department_id = departments.department_id
UNION
SELECT employees.name, departments.department_name
FROM employees
RIGHT JOIN departments ON employees.department_id = departments.department_id;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_9492\1899828954.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name department_name
0       Alan              IT
1      Brian       Marketing
2  Catherine              HR
3      Dylan              IT
4       Evan         Finance
5      Helen       Marketing

In [7]:
conn.close()